Repository: miachillgood/magpie
Catalog: SnapLingo/Localizable.xcstrings
Source language: zh_hans
Languages: en, es, ja, ko, pt_br, zh_hant

source: 点有照片的日子，复习那一天的词
en: Tap a day with photos to review its words
es: Toca un día con fotos para repasar sus palabras
ja: 写真のある日をタップして、その日の単語を復習
ko: 사진이 있는 날을 눌러 그날 단어를 복습해요
pt_br: Toque num dia com fotos para revisar as palavras dele
zh_hant: 點有照片的日子，複習那一天的單字

source: 点照片上的词，把想学的加进来。
en: Tap words on the photo to add the ones you want to learn.
es: Toca palabras en la foto para agregar las que quieras aprender.
ja: 写真の単語をタップして、学びたい単語を追加しましょう。
ko: 사진 속 단어를 눌러 배우고 싶은 단어를 추가해 보세요.
pt_br: Toque nas palavras da foto para adicionar as que quer aprender.
zh_hant: 點照片上的單字，把想學的加進來。

source: 照片会被删除；只在这个场景里出现过的词也会一起删除，其他场景里也有的词会保留。
en: The photo will be deleted, along with any words that only appear in this scene. Words that also appear in other scenes will stay.
es: Se eliminará la foto y también las palabras que solo aparecen en esta escena. Las que también están en otras escenas se conservan.
ja: 写真は削除されます。このシーンにだけ出てきた単語も一緒に削除されますが、ほかのシーンにもある単語は残ります。
ko: 사진이 삭제돼요. 이 장면에만 나온 단어도 함께 삭제되고, 다른 장면에도 있는 단어는 남아요.
pt_br: A foto será apagada. As palavras que só aparecem nesta cena também serão apagadas; as que aparecem em outras cenas ficam.
zh_hant: 照片會被刪除；只在這個場景出現過的單字也會一起刪除，其他場景也有的單字會保留。

source: 照片和单词只存在这台手机上
en: Photos and words stay on this phone
es: Tus fotos y palabras solo se guardan en este teléfono
ja: 写真と単語はこのiPhoneにだけ保存されます
ko: 사진과 단어는 이 휴대폰에만 저장돼요
pt_br: Fotos e palavras ficam só neste celular
zh_hant: 照片和單字只存在這支手機上

source: 照片墙
en: Scenes
es: Fotos
ja: フォトウォール
ko: 사진첩
pt_br: Mural
zh_hant: 照片牆

source: 照片本身、昵称、头像和 Apple 账号
en: The photo itself, your nickname, avatar and Apple Account
es: La foto en sí, tu apodo, tu foto de perfil y tu cuenta de Apple
ja: 写真そのもの、ニックネーム、アイコン、Appleアカウント
ko: 사진 자체, 닉네임, 프로필 사진, Apple 계정
pt_br: A foto em si, seu apelido, seu avatar e sua Conta Apple
zh_hant: 照片本身、暱稱、大頭貼和 Apple 帳號

source: 照片里识别出的英文文字、挑出的单词，以及你的英语水平和母语
en: The English text read from your photo, the words picked from it, and your English level and native language
es: El texto en inglés leído de tu foto, las palabras elegidas, tu nivel de inglés y tu lengua materna
ja: 写真から読み取った英語の文字、選ばれた単語、あなたの英語レベルと母語
ko: 사진에서 인식한 영어 글자, 고른 단어, 그리고 내 영어 레벨과 모국어
pt_br: O texto em inglês lido na sua foto, as palavras escolhidas, seu nível de inglês e sua língua materna
zh_hant: 照片裡辨識出的英文文字、挑出的單字，以及你的英文程度和母語

source: 生活小贴士
en: Local tip
es: Consejo local
ja: 暮らしのヒント
ko: 생활 팁
pt_br: Dica local
zh_hant: 生活小撇步

source: 用名字首字母
en: Use initials
es: Usar mis iniciales
ja: イニシャルを使う
ko: 이름 첫 글자 쓰기
pt_br: Usar iniciais
zh_hant: 用名字的第一個字

source: 用手机号登录
en: Sign in with phone
es: Entrar con teléfono
ja: 電話番号でサインイン
ko: 휴대폰 번호로 로그인
pt_br: Entrar com telefone
zh_hant: 用手機號碼登入

source: 用邮箱登录
en: Sign in with email
es: Entrar con correo
ja: メールでサインイン
ko: 이메일로 로그인
pt_br: Entrar com e-mail
zh_hant: 用電子郵件登入

source: 登录后，单词不会丢
en: Sign in so your words are never lost
es: Inicia sesión y no pierdas tus palabras
ja: サインインで単語を守ろう
ko: 로그인하면 단어가 사라지지 않아요
pt_br: Entre e nunca perca suas palavras
zh_hant: 登入後，單字不會不見

source: 登录没有成功
en: Sign-in didn't work
es: No se pudo iniciar sesión
ja: サインインできませんでした
ko: 로그인하지 못했어요
pt_br: O login não deu certo
zh_hant: 登入沒有成功

source: 登录没有成功：%@
en: Sign-in didn't work: %@
es: No se pudo iniciar sesión: %@
ja: サインインできませんでした：%@
ko: 로그인하지 못했어요: %@
pt_br: O login não deu certo: %@
zh_hant: 登入沒有成功：%@

source: 相机权限已关闭，去设置开启
en: Camera access is off. Turn it on in Settings
es: Permite el acceso a la cámara en Ajustes
ja: カメラへのアクセスがオフです。設定でオンにしてください
ko: 카메라 권한이 꺼져 있어요. 설정에서 켜 주세요
pt_br: Acesso à câmera desativado. Ative nos Ajustes
zh_hant: 相機權限已關閉，前往設定開啟

source: 看看意思
en: See meaning
es: Ver significado
ja: 意味を見る
ko: 뜻 보기
pt_br: Ver significado

source: 看看新词
en: See new words
es: Ver palabras nuevas
ja: 新しい単語を見る
ko: 새 단어 보기
pt_br: Ver palavras novas
zh_hant: 看看新單字

source: 看看这一周
en: See my week
es: Ver la semana
ja: 今週をふり返る
ko: 이번 주 보기
pt_br: Ver a semana
zh_hant: 看看這一週

source: 看结果
en: See results
es: Ver resultado
ja: 結果を見る
ko: 결과 보기
pt_br: Ver resultado
zh_hant: 看結果

source: 睡前
en: Before bed
es: Antes de dormir
ja: 寝る前
ko: 자기 전
pt_br: Antes de dormir

source: 石灰
en: Stone
es: Piedra
ja: ストーングレー
ko: 스톤 그레이
pt_br: Pedra

source: 示意
en: wave to stop
es: hacer señal
ja: 合図する
ko: 신호하다
pt_br: fazer sinal

source: 离「%@」还差一点
en: Almost at %@
es: Te falta poco para “%@”
ja: 「%@」まであと少し
ko: ‘%@’까지 조금 남았어요
pt_br: Falta pouco para “%@”
zh_hant: 離「%@」還差一點

source: 租房
en: Housing
es: Vivienda
ja: 住まい
ko: 주거
pt_br: Moradia
zh_hant: 租屋

source: 稍后再来
en: Again soon
es: En un rato
ja: あとでもう一度
ko: 잠시 후 다시
pt_br: Mais tarde
zh_hant: 稍後再來

source: 第一次见？猜猜它是什么意思 🤔
en: New to you? Guess what it means 🤔
es: ¿Primera vez que la ves? Adivina qué significa 🤔
ja: はじめて見る単語？意味を当ててみましょう 🤔
ko: 처음 보는 단어죠? 무슨 뜻일지 맞혀 보세요 🤔
pt_br: Primeira vez? Tente adivinhar o significado 🤔
zh_hant: 第一次見到？猜猜它是什麼意思 🤔

source: 精通
en: Proficient
es: Maestría
ja: 熟達
ko: 최상급
pt_br: Proficiente

source: 结束学习
en: End session
es: Terminar de estudiar
ja: 学習を終了
ko: 학습 끝내기
pt_br: Encerrar estudo
zh_hant: 結束學習

source: 给自己起个名字
en: Give yourself a name
es: Elige un apodo
ja: ニックネームを決めよう
ko: 닉네임을 정해 보세요
pt_br: Escolha um apelido
zh_hant: 幫自己取個名字

source: 给这个场景起个名字
en: Name this scene
es: Ponle nombre a esta escena
ja: このシーンに名前をつける
ko: 이 장면에 이름을 붙여 주세요
pt_br: Dê um nome a esta cena
zh_hant: 幫這個場景取個名字

source: 继续
en: Continue
es: Continuar
ja: 続ける
ko: 계속
pt_br: Continuar
zh_hant: 繼續

source: 网络连接失败，请检查网络
en: Couldn't connect. Check your internet connection
es: Sin conexión. Revisa tu red
ja: ネットワークに接続できません。接続を確認してください
ko: 네트워크에 연결하지 못했어요. 연결 상태를 확인해 주세요
pt_br: Sem conexão. Verifique sua internet
zh_hant: 網路連線失敗，請檢查網路

source: 能处理租房、银行等正式文件
en: Can handle formal paperwork like leases and bank forms
es: Manejas trámites formales como alquiler o banco
ja: 賃貸や銀行などの正式な書類に対応できる
ko: 집 계약, 은행 같은 공식 서류도 처리할 수 있어요
pt_br: Lida com aluguel, banco e outros documentos formais
zh_hant: 能處理租屋、銀行等正式文件

source: 能应付购物、点餐等日常场景
en: Can get by shopping, ordering food and other everyday tasks
es: Te defiendes al comprar, pedir comida y más
ja: 買い物や注文など日常の場面に対応できる
ko: 쇼핑, 음식 주문 같은 일상 상황을 해결할 수 있어요
pt_br: Se vira em compras, restaurantes e outras situações comuns
zh_hant: 能應付購物、點餐等日常場景

source: 能看懂最常见的标识和价格
en: Can read the most common signs and prices
es: Entiendes los carteles y precios más comunes
ja: よく見る標識や値段がわかる
ko: 가장 흔한 표지판과 가격을 알아볼 수 있어요
pt_br: Entende as placas e os preços mais comuns
zh_hant: 看得懂最常見的標示和價格

source: 能读懂合同条款和专业材料
en: Can read contracts and professional material
es: Entiendes contratos y textos especializados
ja: 契約書や専門的な資料が読める
ko: 계약 조항과 전문 자료도 읽을 수 있어요
pt_br: Lê cláusulas de contrato e textos técnicos
zh_hant: 讀得懂合約條款和專業文件

source: 能读懂大部分生活通知和说明
en: Can understand most everyday notices and instructions
es: Entiendes la mayoría de avisos e instrucciones del día a día
ja: 暮らしのお知らせや説明の大半が読める
ko: 생활 속 안내문과 설명을 대부분 읽을 수 있어요
pt_br: Entende a maioria dos avisos e instruções do dia a dia
zh_hant: 讀得懂大部分的生活通知和說明

source: 自动备份
en: Automatic backup
es: Copia automática
ja: 自動バックアップ
ko: 자동 백업
pt_br: Backup automático
zh_hant: 自動備份

source: 自动备份到云端，换手机登录就能找回。不登录也能用全部功能。
en: Everything backs up to the cloud, so a new phone gets it all back. Every feature also works without an account.
es: Todo se guarda en la nube: en un teléfono nuevo, inicia sesión y lo recuperas. Sin cuenta también puedes usar todas las funciones.
ja: クラウドに自動でバックアップされ、機種変更してもサインインすれば戻ります。サインインしなくてもすべての機能を使えます。
ko: 클라우드에 자동으로 백업돼서 휴대폰을 바꿔도 로그인하면 되찾을 수 있어요. 로그인하지 않아도 모든 기능을 쓸 수 있어요.
pt_br: Tudo fica salvo na nuvem: no celular novo, é só entrar para recuperar. Sem conta você também usa todos os recursos.
zh_hant: 自動備份到雲端，換手機登入就能找回。不登入也能用全部功能。

source: 获取验证码
en: Send code
es: Enviar código
ja: コードを送信
ko: 인증번호 받기
pt_br: Enviar código
zh_hant: 取得驗證碼

source: 街边告示
en: Street notice
es: Avisos en la calle
ja: 街の貼り紙
ko: 길거리 안내문
pt_br: Avisos na rua
zh_hant: 街頭告示

source: 表格文件，可以导入 Anki
en: A spreadsheet you can import into Anki
es: Hoja de cálculo, lista para Anki
ja: 表形式のファイル・Ankiに読み込めます
ko: 표 파일이라 Anki로 가져올 수 있어요
pt_br: Planilha que dá para importar no Anki
zh_hant: 表格檔案，可以匯入 Anki

source: 解释还在生成中，先凭印象评分吧
en: The explanation is still on its way. Rate from memory for now
es: La explicación aún se está generando. Califica según lo que recuerdes
ja: 解説はまだ作成中です。まずは感覚で評価しましょう
ko: 설명을 아직 만드는 중이에요. 기억나는 대로 먼저 평가해 보세요
pt_br: A explicação ainda está sendo gerada. Avalie pelo que você lembra
zh_hant: 解釋還在產生中，先憑印象評分吧

source: 认识
en: Got it
es: La sé
ja: 覚えてる
ko: 알아요
pt_br: Acertei
zh_hant: 記得

source: 让 AI 帮你挑词、写释义
en: Let AI pick words and write meanings
es: Palabras y significados con IA
ja: 単語選びと意味はAIにおまかせ
ko: AI가 단어를 고르고 뜻을 써 줘요
pt_br: Palavras e significados com IA
zh_hant: 讓 AI 挑單字、寫釋義

source: 记住率
en: Recall rate
es: Aciertos
ja: 記憶率
ko: 기억률
pt_br: Acertos
zh_hant: 記住率

source: 设置
en: Settings
es: Ajustes
ja: 設定
ko: 설정
pt_br: Ajustes
zh_hant: 設定

source: 识别出的文字
en: Recognized text
es: Texto detectado
ja: 読み取ったテキスト
ko: 인식한 텍스트
pt_br: Texto reconhecido
zh_hant: 辨識出的文字

source: 识别出的文字会发给 Anthropic 的 Claude
en: Text read from photos is sent to Claude by Anthropic
es: El texto reconocido se envía a Claude, de Anthropic
ja: 読み取った文字はAnthropicのClaudeに送信されます
ko: 인식한 글자가 Anthropic의 Claude로 전송돼요
pt_br: O texto reconhecido é enviado ao Claude, da Anthropic
zh_hant: 辨識出的文字會傳給 Anthropic 的 Claude

source: 词会自己**跳出来**
en: watch words **pop out**
es: y las palabras **saltan**
ja: 単語が**飛び出す**
ko: 단어가 **톡 튀어나와요**
pt_br: e as palavras **saltam**
zh_hant: 單字會自己**跳出來**

source: 词库
en: Word library
es: Vocabulario
ja: 単語帳
ko: 단어장
pt_br: Vocabulário
zh_hant: 單字庫

source: 词库还是空的
en: Your word library is empty
es: Tu vocabulario está vacío
ja: 単語帳はまだ空です
ko: 단어장이 아직 비어 있어요
pt_br: Seu vocabulário está vazio
zh_hant: 單字庫還是空的

source: 试听一句
en: Hear a sample
es: Escuchar una frase
ja: 試しに聞く
ko: 미리 듣기
pt_br: Ouvir um exemplo
zh_hant: 試聽一句

source: 该复习的排在前面
en: Due words first
es: Primero las que toca repasar
ja: 復習が必要な順
ko: 복습할 차례인 장면부터
pt_br: Pendentes primeiro
zh_hant: 該複習的排在前面

source: 请把英文放进框里
en: Fit the English inside the frame
es: Pon el texto en inglés dentro del marco
ja: 英語を枠の中に入れてください
ko: 영어가 프레임 안에 들어오게 해 주세요
pt_br: Coloque o texto em inglês dentro do quadro
zh_hant: 請把英文放進框裡

source: 请求太频繁了，稍等一下再试
en: Too many requests. Wait a moment and try again
es: Demasiadas solicitudes. Espera un momento e inténtalo de nuevo
ja: リクエストが多すぎます。少し待ってからお試しください
ko: 요청이 너무 많아요. 잠시 후 다시 시도해 주세요
pt_br: Muitos pedidos seguidos. Espere um pouco e tente de novo
zh_hant: 請求太頻繁了，稍等一下再試

source: 请留意
en: Heads up
es: Ten en cuenta
ja: ご注意ください
ko: 참고해 주세요
pt_br: Atenção
zh_hant: 請留意

source: 读取照片失败：%@
en: Couldn't load the photo: %@
es: No se pudo leer la foto: %@
ja: 写真を読み込めませんでした：%@
ko: 사진을 불러오지 못했어요: %@
pt_br: Não deu para ler a foto: %@
zh_hant: 讀取照片失敗：%@

source: 账号
en: Account
es: Cuenta
ja: アカウント
ko: 계정
pt_br: Conta
zh_hant: 帳號

source: 购物
en: Shopping
es: Compras
ja: ショッピング
ko: 쇼핑
pt_br: Compras
zh_hant: 購物

source: 超市
en: Supermarket
es: Supermercado
ja: スーパー
ko: 마트
pt_br: Mercado

source: 超市价签
en: Price tag
es: Precios del súper
ja: スーパーの値札
ko: 마트 가격표
pt_br: Preços no mercado
zh_hant: 超市價格標籤

source: 跳过
en: Skip
es: Omitir
ja: スキップ
ko: 건너뛰기
pt_br: Pular
zh_hant: 略過

source: 轻松
en: Relaxed
es: Tranquilo
ja: のんびり
ko: 가볍게
pt_br: Leve
zh_hant: 輕鬆

source: 输入验证码
en: Enter the code
es: Escribe el código
ja: 確認コードを入力
ko: 인증번호 입력
pt_br: Digite o código
zh_hant: 輸入驗證碼

source: 返回
en: Back
es: Atrás
ja: 戻る
ko: 뒤로
pt_br: Voltar

source: 返回的数据看不懂，请重试
en: Couldn't understand the response. Please try again
es: No entendimos la respuesta. Inténtalo de nuevo
ja: 受け取ったデータを読み取れませんでした。もう一度お試しください
ko: 받은 데이터를 읽을 수 없어요. 다시 시도해 주세요
pt_br: Não deu para entender a resposta. Tente de novo
zh_hant: 回傳的資料看不懂，請重試

source: 还有 %lld 个词，花几分钟就能完成今日计划。
en: %lld words to go. A few minutes and today's plan is done.
es: Te quedan %lld palabras: en unos minutos completas tu plan de hoy.
ja: あと%lld語。数分で今日のプランを達成できます。
ko: 단어 %lld개만 남았어요. 몇 분이면 오늘 계획을 끝낼 수 있어요.
pt_br: Faltam %lld palavras. Em poucos minutos você termina o plano de hoje.
zh_hant: 還有 %lld 個單字，花幾分鐘就能完成今日計畫。

source: 还没发现新单词
en: no new words yet
es: aún no hay palabras nuevas
ja: 新しい単語はまだありません
ko: 아직 새 단어를 못 찾았어요
pt_br: nenhuma palavra nova ainda
zh_hant: 還沒發現新單字

source: 还没开始学
en: Not started yet
es: Sin empezar
ja: まだ学習していません
ko: 아직 배우지 않았어요
pt_br: Ainda não estudada
zh_hant: 還沒開始學

source: 还没有从这个场景保存单词。
en: No words saved from this scene yet.
es: Aún no guardaste palabras de esta escena.
ja: このシーンからはまだ単語を保存していません。
ko: 이 장면에서 아직 저장한 단어가 없어요.
pt_br: Nenhuma palavra salva desta cena ainda.
zh_hant: 還沒有從這個場景儲存單字。

source: 还没有要复习的词
en: Nothing to review yet
es: Aún no hay palabras para repasar
ja: まだ復習する単語はありません
ko: 아직 복습할 단어가 없어요
pt_br: Nada para revisar ainda
zh_hant: 還沒有要複習的單字

source: 还没有配置 Claude API Key
en: Claude API Key isn't set up yet
es: Falta configurar la Claude API Key
ja: Claude API Keyがまだ設定されていません
ko: Claude API Key가 아직 설정되지 않았어요
pt_br: A Claude API Key ainda não foi configurada
zh_hant: 還沒有設定 Claude API Key

source: 还没登录 · 数据只存在这台手机上
en: Not signed in · Data stays on this phone
es: Sin sesión iniciada · Tus datos solo están en este teléfono
ja: 未サインイン · データはこのiPhoneにだけ保存されます
ko: 로그인 전 · 데이터는 이 휴대폰에만 저장돼요
pt_br: Sem login · os dados ficam só neste celular
zh_hant: 還沒登入 · 資料只存在這支手機上

source: 还记得它的意思吗？
en: Remember what it means?
es: ¿Recuerdas qué significa?
ja: 意味を覚えていますか？
ko: 무슨 뜻인지 기억나요?
pt_br: Lembra o que significa?
zh_hant: 還記得它的意思嗎？

source: 这一轮完成！
en: Round complete!
es: ¡Ronda completada!
ja: このラウンド完了！
ko: 이번 라운드 완료!
pt_br: Rodada concluída!
zh_hant: 這一輪完成！

source: 这些词都还没到复习时间，这次只是再看一遍，不打乱复习安排
en: None of these are due yet, so this is just a refresher. Your review schedule won't change
es: Aún no toca repasar estas palabras. Esto es solo práctica y no cambia tu plan de repaso
ja: どの単語もまだ復習の時期ではありません。今回は見直すだけで、復習スケジュールは変わりません
ko: 아직 복습할 때가 아닌 단어들이에요. 이번엔 한 번 더 보기만 하고, 복습 일정은 그대로예요
pt_br: Essas palavras ainda não estão na hora de revisar. É só uma olhada extra, sem mexer no seu plano
zh_hant: 這些單字都還沒到複習時間，這次只是再看一遍，不會打亂複習排程

source: 这周你在
en: This week you visited
es: Esta semana, en
ja: 今週は
ko: 이번 주에는
pt_br: Esta semana você
zh_hant: 這週你在

source: 这周遇见的词
en: Words you met this week
es: Palabras de esta semana
ja: 今週出会った単語
ko: 이번 주에 만난 단어
pt_br: Palavras da semana
zh_hant: 這週遇見的單字

source: 这天的词都标成已掌握了
en: All words from this day are marked as mastered
es: Todas las palabras de este día están marcadas como dominadas
ja: この日の単語はすべて習得済みです
ko: 이날 단어는 모두 ‘암기 완료’로 표시돼 있어요
pt_br: Todas as palavras deste dia estão marcadas como “Já sei”
zh_hant: 這天的單字都標成已掌握了

source: 这张照片无法打开，换一张试试。
en: Can't open this photo. Try another one.
es: No se puede abrir esta foto. Prueba con otra.
ja: この写真は開けません。別の写真で試してください。
ko: 이 사진은 열 수 없어요. 다른 사진으로 해 보세요.
pt_br: Não deu para abrir esta foto. Tente outra.
zh_hant: 這張照片打不開，換一張試試。

source: 这里还没有词
en: No words here yet
es: Aún no hay palabras aquí
ja: まだ単語がありません
ko: 아직 단어가 없어요
pt_br: Nenhuma palavra aqui ainda
zh_hant: 這裡還沒有單字

source: 进取
en: Intense
es: Intenso
ja: がっつり
ko: 열심히
pt_br: Intenso
zh_hant: 積極

# 进度 %lld / %lld
source: 进度 %1$lld / %2$lld
en: Progress: %lld of %lld
es: Progreso: %lld de %lld
ja: 進捗 %lld / %lld
ko: 진행 %lld / %lld
pt_br: Progresso: %lld de %lld
zh_hant: 進度 %lld / %lld

source: 进阶
en: Intermediate
es: Intermedio
ja: 中級
ko: 중급
pt_br: Intermediário
zh_hant: 進階

source: 进阶挑战
en: Challenge words
es: Para retarte
ja: ステップアップ
ko: 도전 단어
pt_br: Desafio extra
zh_hant: 進階挑戰

source: 连续 %lld 天
en: %lld-day streak
es: Racha de %lld días
ja: %lld日連続
ko: %lld일 연속
pt_br: %lld dias seguidos
zh_hant: 連續 %lld 天

source: 退出登录
en: Sign out
es: Cerrar sesión
ja: サインアウト
ko: 로그아웃
pt_br: Sair da conta
zh_hant: 登出

source: 退出登录？
en: Sign out?
es: ¿Cerrar sesión?
ja: サインアウトしますか？
ko: 로그아웃할까요?
pt_br: Sair da conta?
zh_hant: 要登出嗎？

source: 选择要加入的词
en: Select words to add
es: Elige palabras para agregar
ja: 追加する単語を選択
ko: 추가할 단어 고르기
pt_br: Escolha palavras para adicionar
zh_hant: 選擇要加入的單字

source: 选词
en: Pick words
es: Elegir palabras
ja: 単語を選ぶ
ko: 단어 고르기
pt_br: Escolher palavras
zh_hant: 挑選單字

source: 通知权限已关闭，请在系统设置里允许
en: Notifications are off. Allow them in Settings
es: Las notificaciones están desactivadas. Actívalas en Ajustes
ja: 通知がオフになっています。設定アプリで許可してください
ko: 알림 권한이 꺼져 있어요. 설정에서 허용해 주세요
pt_br: Notificações desativadas. Ative nos Ajustes
zh_hant: 通知權限已關閉，請到系統設定中允許

source: 遇见 **%lld** 个词，还记得几个？
en: you spotted **%lld** words. Still remember them?
es: viste **%lld** palabras. ¿Cuántas recuerdas?
ja: **%lld**個の単語に出会いました。いくつ覚えてる？
ko: 단어 **%lld**개를 만났어요. 몇 개나 기억나요?
pt_br: você viu **%lld** palavras. Quantas ainda lembra?
zh_hant: 遇見 **%lld** 個單字，還記得幾個？

source: 那天遇见的词
en: Words from that day
es: Palabras de ese día
ja: この日に出会った単語
ko: 그날 만난 단어
pt_br: Palavras daquele dia
zh_hant: 那天遇見的單字

source: 邮箱
en: Email
es: Correo
ja: メールアドレス
ko: 이메일
pt_br: E-mail
zh_hant: 電子郵件

source: 释义
en: Meaning
es: Significado
ja: 意味
ko: 뜻
pt_br: Significado
zh_hant: 釋義

source: 重命名
en: Rename
es: Renombrar
ja: 名前を変更
ko: 이름 바꾸기
pt_br: Renomear
zh_hant: 重新命名

source: 重命名场景
en: Rename scene
es: Renombrar escena
ja: シーン名を変更
ko: 장면 이름 바꾸기
pt_br: Renomear cena
zh_hant: 重新命名場景

source: 重拍
en: Retake
es: Repetir foto
ja: 撮り直す
ko: 다시 찍기
pt_br: Tirar outra

source: 重新发送
en: Resend
es: Reenviar
ja: 再送信
ko: 다시 보내기
pt_br: Reenviar
zh_hant: 重新傳送

source: 重新拍
en: Retake
es: Repetir foto
ja: 撮り直す
ko: 다시 찍기
pt_br: Tirar de novo

source: 重新测一次
en: Retake the test
es: Repetir la prueba
ja: もう一度テスト
ko: 다시 테스트하기
pt_br: Refazer o teste
zh_hant: 重新測一次

source: 重试
en: Try again
es: Reintentar
ja: 再試行
ko: 다시 시도
pt_br: Tentar de novo
zh_hant: 重試

source: 银行
en: Banking
es: Banco
ja: 銀行
ko: 은행
pt_br: Banco
zh_hant: 銀行

source: 随时可以删除
en: Delete anytime
es: Bórrala cuando quieras
ja: いつでも削除できる
ko: 언제든 삭제 가능
pt_br: Apague quando quiser
zh_hant: 隨時可以刪除

source: 随时可以回来再选词
en: You can come back and pick more words anytime
es: Puedes volver a elegir palabras cuando quieras
ja: いつでも戻って単語を選べます
ko: 언제든 돌아와서 단어를 더 고를 수 있어요
pt_br: Você pode voltar e escolher palavras quando quiser
zh_hant: 隨時可以回來再挑單字

source: 随时可以在“我的”里调整，到期的复习会优先安排。
en: You can change this anytime in “Me”. Due reviews always come first.
es: Puedes cambiarlo cuando quieras en “Perfil”. Los repasos pendientes siempre van primero.
ja: 「マイページ」でいつでも変更できます。期限が来た復習が優先されます。
ko: ‘마이’에서 언제든 바꿀 수 있어요. 복습할 단어가 먼저 배정돼요.
pt_br: Dá para mudar quando quiser em “Perfil”. As revisões pendentes vêm primeiro.
zh_hant: 隨時可以在「我的」裡調整，到期的複習會優先安排。

source: 隐藏照片上的单词标记
en: Hide word labels on photo
es: Ocultar marcas de palabras en la foto
ja: 写真の単語マークを非表示
ko: 사진 위 단어 표시 숨기기
pt_br: Ocultar marcações das palavras na foto
zh_hant: 隱藏照片上的單字標記

source: 需要联网重新生成，场景标题不会改，你可以自己重命名。
en: This needs an internet connection to regenerate. Scene titles won't change, but you can rename them yourself.
es: Se regeneran con conexión a internet. Los títulos de las escenas no cambian, pero puedes renombrarlas tú.
ja: 作り直すにはインターネット接続が必要です。シーン名は変わらないので、自分で変更できます。
ko: 인터넷에 연결해 다시 만들어요. 장면 제목은 바뀌지 않으니 직접 이름을 바꿔 주세요.
pt_br: Precisa de internet para gerar de novo. Os títulos das cenas não mudam, mas você pode renomeá-las.
zh_hant: 需要連網重新產生，場景標題不會變，你可以自己重新命名。

source: 餐厅
en: Café & dining
es: Restaurantes
ja: 飲食店
ko: 카페·식당
pt_br: Restaurante
zh_hant: 餐廳

source: 验证码
en: Verification code
es: Código de verificación
ja: 確認コード
ko: 인증번호
pt_br: Código de verificação
zh_hant: 驗證碼

source: 验证码 10 分钟内有效。没收到的话，看看垃圾邮件文件夹。
en: The code works for 10 minutes. Didn't get it? Check your spam folder.
es: El código vale 10 minutos. ¿No te llegó? Revisa la carpeta de spam.
ja: コードの有効期限は 10 分です。届かない場合は迷惑メールフォルダを確認してください。
ko: 인증번호는 10분 동안 유효해요. 받지 못했다면 스팸함을 확인해 주세요.
pt_br: O código vale por 10 minutos. Não chegou? Veja a pasta de spam.
zh_hant: 驗證碼 10 分鐘內有效。沒收到的話，看看垃圾郵件資料夾。

source: 验证码不对，再试一次
en: That code isn't right. Try again
es: Ese código no es correcto. Inténtalo de nuevo
ja: コードが違います。もう一度お試しください
ko: 인증번호가 맞지 않아요. 다시 시도해 주세요
pt_br: Esse código não está certo. Tente de novo
zh_hant: 驗證碼不對，再試一次

source: 高级
en: Advanced
es: Avanzado
ja: 上級
ko: 고급
pt_br: Avançado
zh_hant: 高級

source: 👆 点照片上的词也能加入
en: 👆 You can also tap words on the photo to add them
es: 👆 También puedes tocar palabras en la foto para agregarlas
ja: 👆 写真の単語をタップしても追加できます
ko: 👆 사진 속 단어를 눌러도 추가할 수 있어요
pt_br: 👆 Toque nas palavras da foto para adicionar
zh_hant: 👆 點照片上的單字也能加入

source: 📷 在照片里
en: 📷 In the photo
es: 📷 En la foto
ja: 📷 写真の中
ko: 📷 사진 속에서
pt_br: 📷 Na foto
zh_hant: 📷 在照片裡

source: 🔥 已经连续学习 %lld 天
en: 🔥 You're on a %lld-day streak
es: 🔥 Racha de %lld días
ja: 🔥 %lld日連続で学習中
ko: 🔥 벌써 %lld일 연속으로 공부했어요
pt_br: 🔥 Já são %lld dias seguidos de estudo
zh_hant: 🔥 已經連續學習 %lld 天

source: 😕 %@。你可以直接点照片上的词来添加。
en: 😕 %@. You can still tap words on the photo to add them.
es: 😕 %@. Puedes tocar las palabras de la foto para agregarlas.
ja: 😕 %@。写真の単語をタップして直接追加できます。
ko: 😕 %@. 사진 속 단어를 직접 눌러서 추가할 수 있어요.
pt_br: 😕 %@. Você pode tocar nas palavras da foto para adicioná-las.
zh_hant: 😕 %@。你可以直接點照片上的單字來新增。

source: 😕 解释生成失败
en: 😕 Couldn't write the explanation
es: 😕 No se pudo generar la explicación
ja: 😕 解説を作成できませんでした
ko: 😕 설명을 만들지 못했어요
pt_br: 😕 Não deu para gerar a explicação
zh_hant: 😕 解釋產生失敗
